//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Получить время от старта программы порядка мсек, учитывая переполнение счетчика

    Author: Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date:   07.07.2006
*/                                                                                      //
//======================================================================================//
#ifndef _TIME_FROM_START_PROVIDER_6857627063860106_
#define _TIME_FROM_START_PROVIDER_6857627063860106_

//! \brief Получить время от старта программы порядка мсек

boost::uint64_t GetTimeFromStart();

#endif // _TIME_FROM_START_PROVIDER_6857627063860106_