//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Чтение архивного видеофайла

    Author Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date   17.06.2006
*/                                                                                      //
//======================================================================================//
#include "stdafx.h"
#include "ArchiveFileReader.h"
//======================================================================================//
//                               class ArchiveFileReader                                //
//======================================================================================//

ArchiveFileReader::ArchiveFileReader()
{
}

ArchiveFileReader::~ArchiveFileReader()
{
}