//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Запрос данных сервер->камера

    Author Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date   20.01.2006
*/                                                                                      //
//======================================================================================//
#include "stdafx.h"
#include "MsgCameraRequestData.h"
//======================================================================================//
//                                class MsgCameraGetData                                //
//======================================================================================//
/*
MsgCameraRequestData::MsgCameraRequestData()
{
}

MsgCameraRequestData::~MsgCameraRequestData()
{
}*/