//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Классы состояния архивного видео - проигрывание, пауза, стоп

    Author: Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date:   24.03.2006
*/                                                                                      //
//======================================================================================//

#include "stdafx.h"
#include "ArchiveVideoState.h"

//======================================================================================//
//                               class ArchiveVideoState                                //
//======================================================================================//

ArchiveVideoState::ArchiveVideoState()
{
}

ArchiveVideoState::~ArchiveVideoState()
{
}