//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Классы состояния архивного видео - проигрывание, пауза, стоп

    Author: Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date:   24.03.2006
*/                                                                                      //
//======================================================================================//
#ifndef _ARCHIVE_VIDEO_STATE_5607957268969444_
#define _ARCHIVE_VIDEO_STATE_5607957268969444_

//======================================================================================//
//                               class ArchiveVideoState                                //
//======================================================================================//

//! \brief Классы состояния архивного видео - проигрывание, пауза, стоп
//! \author Eugene Gorbachev (Eugene.Gorbachev@biones.com)
//! \date   24.03.2006
//! \version 1.0
//! \bug 
//! \todo 

class ArchiveVideoState
{
public:
	ArchiveVideoState();
	virtual ~ArchiveVideoState();
};

#endif // _ARCHIVE_VIDEO_STATE_5607957268969444_