//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Базовый код соединения через сеть

    Author: Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date:   04.07.2006
*/                                                                                      //
//======================================================================================//

#include "chcs.h"
#include "BasicNetExchange.h"
