//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Поток с интерефейсом отладки и очередью сообщений

    Author: Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date:   25.01.2006
*/                                                                                      //
//======================================================================================//

#include "stdafx.h"
#include "BaseQueueThread.h"

//======================================================================================//
//                                class BaseQueueThread                                 //
//======================================================================================//

BaseQueueThread::BaseQueueThread(boost::shared_ptr<Elvees::IMessage> pMsg):
	m_Msg( pMsg ) 
{
}

BaseQueueThread::~BaseQueueThread()
{
}