//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Кроссплатформенная ф-я приостановка потока на мс

    Author: Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date:   04.04.2006
*/                                                                                      //
//======================================================================================//
#ifndef _PLAT_SLEEP_1379698148273389_
#define _PLAT_SLEEP_1379698148273389_

//!  Кроссплатформенная ф-я приостановка потока на мс
//!	 \param ms period for sleeping in milliseconds

void PlatSleep(unsigned int ms);

#endif // _PLAT_SLEEP_1379698148273389_