//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Посредник сервер-клиент при передачи кадров

    Author: Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date:   13.04.2006
*/                                                                                      //
//======================================================================================//
#ifndef _LOCAL_TIER_3020863313409410_
#define _LOCAL_TIER_3020863313409410_

//======================================================================================//
//                                   class ILocalTier                                    //
//======================================================================================//

//! \brief Посредник сервер-клиент при передачи кадров
//! \author Eugene Gorbachev (Eugene.Gorbachev@biones.com)
//! \date   13.04.2006
//! \version 1.0
//! \bug 
//! \todo 

class ILocalTier
{
public:
	
	//! установить сервером кадр для потока
	//! \param pFrame		исходный кадр от сервера
	virtual void			SetFrame( CHCS::IFrame* pFrame ) = 0;

	//! вернуть клиенту кадр
	//! \param StreamUID	идентификатор потока, для которого возвращается кадр
	//! \return кадр в формате RGB24 для клиента
	virtual CHCS::IFrame*	GetFrame( int StreamID ) = 0;

	//! очистить все кадры,
	//! поскольку видеоподсистема уничтажается раньше чем статический объект связки,
	//! то необходимо очистить невалидные кадры
	virtual void	FlushFrames() = 0;

	virtual ~ILocalTier() {};
};

//! получить глобальный объект как синглтон
//! \return указатель на реализацию
ILocalTier* GetLocalTier();

#endif // _LOCAL_TIER_3020863313409410_