//======================================================================================//
//                                         DVR                                          //
//                                                                                      //
//                               Copyright© ElVEES, 2006                                //
//                                                                                      //
//--------------------------------------------------------------------------------------//
/* Description: Архивный сетевой клиент

    Author: Eugene Gorbachev (Eugene.Gorbachev@biones.com)
    Date:   04.07.2006
*/                                                                                      //
//======================================================================================//

#include "chcs.h"
#include "RemoteArchiveConsumer.h"

//======================================================================================//
//                             class RemoteArchiveConsumer                              //
//======================================================================================//

RemoteArchiveConsumer::RemoteArchiveConsumer()
{
}

RemoteArchiveConsumer::~RemoteArchiveConsumer()
{
}